Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.SetInputPointsInfo(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.ConnectionInputPointInfo})
Sets the list of description information used to select additional points by some connections.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.GetInputPointsInfo
Returns a list of description information used to select additional points by some connections.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.HasMediumRepr
States if connection type should display any graphics in Coarse view.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.HasCoarseRepr
States if connection type should display any graphics in Coarse view.
Since:
2017